Catalogs/ПравилаОпределенияВидаПотолка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПравилаОпределенияВидаПотолка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПравилаОпределенияВидаПотолка/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВидНоменклатурыПотолка(ПараметрыПотолка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПравилаОпределенияВидаПотолкаПараметры.Ссылка КАК Ссылка,
	|	ПравилаОпределенияВидаПотолкаПараметры.Имя КАК Имя,
	|	ПравилаОпределенияВидаПотолкаПараметры.Значение КАК Значение
	|ИЗ
	|	Справочник.ПравилаОпределенияВидаПотолка.Параметры КАК ПравилаОпределенияВидаПотолкаПараметры
	|ГДЕ
	|	ПравилаОпределенияВидаПотолкаПараметры.Использовать
	|	И ПравилаОпределенияВидаПотолкаПараметры.Ссылка = &Правило";
	
	//проверяем на отрез
	//Правило = Константы.ПравилоОпределенияОтреза.Получить(); #12532 закомментировано	
	//Если НЕ Правило.Пустая() Тогда
	Запрос.УстановитьПараметр("Правило", Справочники.ПравилаОпределенияВидаПотолка.Отрез);
	РезультатЗапроса = Запрос.Выполнить();		
	
	ЭтоОтрез = Истина;
	Если РезультатЗапроса.Пустой() Тогда
		ЭтоОтрез = Ложь;
	Иначе
		Выборка = РезультатЗапроса.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Если СокрЛП(Выборка.Имя) = "МатериалГарпун" Тогда					
				Если ПараметрыПотолка.Гарпуны.Количество() = 1 Тогда
					Если НЕ СокрЛП(Выборка.Значение) = ПараметрыПотолка.Гарпуны[0].Материал Тогда
						ЭтоОтрез = Ложь;
						Прервать;	
					КонецЕсли;
				Иначе
					// многогарпунная продукция не может быть отрезом
					ЭтоОтрез = Ложь;
					Прервать;
				КонецЕсли;
			Иначе					
				Если НЕ СокрЛП(Выборка.Значение) = СокрЛП(ОбменСEasyCeiling.ПолучитьЗначениеРеквизита(ПараметрыПотолка, Выборка.Имя)) Тогда
					ЭтоОтрез = Ложь;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоОтрез Тогда
		Возврат Справочники.ВидыНоменклатуры.Отрез;
	КонецЕсли;
	//КонецЕсли;
	
	//#12523 закомментировано 
	//проверяем на типовой отрез
	//Правило = Константы.ПравилоОпределенияТиповогоОтреза.Получить();	
	//Если НЕ Правило.Пустая() Тогда

	//	Запрос.УстановитьПараметр("Правило", Правило);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	ЭтоОтрез = Истина;
	//	Пока Выборка.Следующий() Цикл			
	//		Если НЕ СокрЛП(Выборка.Значение) = СокрЛП(ОбменСEasyCeiling.ПолучитьЗначениеРеквизита(ПараметрыПотолка, Выборка.Имя)) Тогда
	//			ЭтоОтрез = Ложь;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если ЭтоОтрез Тогда
	//		Возврат Справочники.ВидыНоменклатуры.ТиповойОтрез;
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат Справочники.ВидыНоменклатуры.Потолок;
	
КонецФункции

#КонецОбласти

#КонецЕсли
